#include "node.h"

/***********************************************************************
  Задача 2. Да се дефинира функция removedups, която приема като
  единствен параметър указател към линеен едносвързан списък от цели
  числа, наредени в ненамаляващ ред. Функцията да изтрива всички
  повторения на елементи в списъка, така че всеки от оригиналните му
  елементи да се среща само веднъж, така че елементите на списъка да
  образуват строго растяща редица. Задачата да се реши без използване
  на помощна структура от данни (с константна сложност по памет).
************************************************************************/

/***********************************************************************
 РЕШЕНИЕ:
************************************************************************/

void removedups(node<int>* l)
{
  if (l == nullptr)
    return;

  node<int> *save;

  while (l->next != nullptr)
  {
    while (l->data == l->next->data)
    {
      save = l->next->next;
      delete l->next;
      l->next = save;
    }
    l = l->next;
  }
}

/***********************************************************************
 КРАЙ НА РЕШЕНИЕТО
************************************************************************/

#define DOCTEST_CONFIG_IMPLEMENT
#include "doctest.h"

/***********************************************************************
  РАЗКОМЕНТРИАЙТЕ СЛЕДВАЩИЯ РЕД, ЗА ДА ВКЛЮЧИТЕ ТЕСТОВЕТЕ
************************************************************************/
//#include "prob2_tests.h"

int main ()
{
    // пускане на тестовете
    doctest::Context().run();
    return 0;
}
